{
  "engine_key": "genealogy_pass2_prior_scanning",
  "engine_name": "Genealogy Pass 2: Prior Work Scanning (Relationship-Aware)",
  "description": "Second pass of intellectual genealogy: scans a single prior work for genealogical connections to the current work. ADAPTS analysis strategy based on the relationship classification from Pass 1B. For direct precursors: traces specific ideas. For indirect contextualizers: identifies foundational patterns and intellectual toolkits. For different-field works: detects cross-domain transfers. For counter-positions: analyzes reversals. Runs ONCE PER PRIOR WORK.",
  "version": 3,
  "category": "temporal",
  "kind": "extraction",
  "reasoning_domain": "genealogy_analysis",
  "researcher_question": "What genealogical connections — direct traces, foundational patterns, cross-domain transfers, or position reversals — exist between this prior work and the current work?",
  "canonical_schema": {
    "prior_work_info": {
      "title": "string - title of the prior work being scanned",
      "year": "string - year of publication",
      "context": "string - what this work was about and its intellectual context",
      "relationship_type": "direct_precursor | indirect_contextualizer | different_field_relevant | counter_position | tangential - as classified by Pass 1B"
    },
    "traces_found": [
      {
        "trace_id": "string (format: 'TR{N}')",
        "target_idea_id": "string - references idea_id from pass 1",
        "target_idea_name": "string - name of the target idea for readability",
        "form_in_prior_work": "proto_form | full_form | contradictory_form | absent_but_implied | different_framing",
        "description": "string - how this idea appears in the prior work",
        "textual_evidence": [
          {
            "quote": "string - direct quote from the prior work",
            "location": "string - approximate location in the prior work"
          }
        ],
        "confidence": "high | medium | low",
        "notable_differences": "string - how the prior version differs from the current version",
        "function_in_prior_work": "string - what role this idea played in the prior argument",
        "vocabulary_comparison": {
          "shared_terms": ["string - terms used in both works for this idea"],
          "prior_terms_replaced": ["string - terms used in the prior work that were later abandoned or renamed"],
          "semantic_drift": "string - if the same term is used, how has its meaning shifted?"
        },
        "methodological_comparison": "string - does the author argue for this idea using the same evidence types and analytical moves as in the current work, or differently?",
        "metaphor_comparison": "string - are the same metaphors used? Have metaphors evolved (simpler → more elaborate, or different metaphor entirely)?",
        "framing_comparison": {
          "prior_framing": "tentative | qualified | definitive | axiomatic | exploratory",
          "current_framing": "tentative | qualified | definitive | axiomatic | exploratory",
          "framing_shift": "string - describe the confidence trajectory: did this go from tentative to definitive? From exploratory to axiomatic? This directly feeds escalation detection in Pass 5"
        }
      }
    ],
    "ideas_not_found": [
      {
        "idea_id": "string - target idea_id not found in this prior work",
        "idea_name": "string - name of the absent idea",
        "significance_of_absence": "string - what it means that this idea wasn't present yet"
      }
    ],
    "foundational_patterns": [
      {
        "pattern_id": "string (format: 'FP{N}')",
        "pattern_name": "string - concise name for this foundational pattern",
        "pattern_description": "string - what this thinking pattern, analytical method, or cognitive habit consists of",
        "how_it_enables_current_work": "string - how this pattern enables, shapes, or informs the current work's arguments, even if the author doesn't consciously deploy it",
        "textual_evidence_prior": [
          {
            "quote": "string - quote from the prior work showing this pattern",
            "location": "string - approximate location"
          }
        ],
        "manifestation_in_current_work": "string - where and how this pattern appears (perhaps transformed) in the current work",
        "matched_methodological_signature": "string - if this pattern corresponds to a specific methodological signature from the target work's profile, name it here. This is the KEY link — it connects the prior work's method to the current work's method.",
        "vocabulary_carried_forward": ["string - specific terms or phrases from this prior work that persist into the current work, even if repurposed"],
        "pattern_type": "analytical_method | cognitive_habit | recurring_metaphor | problem_solving_approach | theoretical_framework | argumentative_structure | epistemic_commitment",
        "author_awareness": "explicit | implicit | unconscious - whether the author seems aware of deploying this pattern from their earlier work"
      }
    ],
    "cross_domain_transfers": [
      {
        "transfer_id": "string (format: 'XD{N}')",
        "source_domain": "string - the domain of the prior work",
        "target_domain": "string - the domain of the current work",
        "what_transferred": "string - what method, framework, metaphor, or structural analogy was imported",
        "how_transformed": "string - how the transferred element was adapted for the new domain",
        "validity_of_transfer": "string - whether the cross-domain move is analytically justified or introduces distortions",
        "blind_spots_created": "string - what the author's expertise in the source domain causes them to miss or distort in the target domain",
        "unique_insights_enabled": "string - what the cross-domain perspective uniquely reveals"
      }
    ],
    "reversal_analysis": {
      "positions_reversed": [
        {
          "reversal_id": "string (format: 'REV{N}')",
          "prior_position": "string - what the author argued before",
          "current_position": "string - what the author argues now",
          "nature_of_shift": "full_reversal | significant_modification | subtle_drift | recontextualization",
          "evidence_prior": "string - quote or reference from prior work",
          "evidence_current": "string - quote or reference from current work",
          "how_managed": "string - does the author acknowledge, explain, minimize, or ignore the reversal?",
          "what_drove_change": "string - hypothesized reason for the shift"
        }
      ],
      "continuities_despite_reversal": "string - what remains consistent even as positions changed"
    },
    "new_discoveries": [
      {
        "discovery": "string - ideas in the prior work that are relevant but weren't in our target list",
        "relevance": "string - why this discovery matters for the genealogical analysis"
      }
    ],
    "meta": {
      "relationship_type": "string - the classified relationship type from Pass 1B",
      "analysis_strategy_used": "string - which analysis approach was applied based on the relationship type",
      "traces_found_count": "number",
      "foundational_patterns_count": "number",
      "cross_domain_transfers_count": "number",
      "reversals_count": "number",
      "ideas_not_found_count": "number",
      "coverage_ratio": "number (0-1) - for direct_precursor: fraction of target ideas found. For other types: fraction of meaningful connections identified relative to potential",
      "key_findings": ["string - notable observations about this prior work's relationship to the current work"]
    }
  },
  "extraction_focus": [
    "genealogical_traces",
    "conceptual_precedents",
    "foundational_patterns",
    "cross_domain_transfers",
    "position_reversals",
    "absent_ideas"
  ],
  "primary_output_modes": [
    "structured_text_report",
    "table"
  ],
  "paradigm_keys": [],
  "source_file": "intellectual_genealogy_workflow",
  "stage_context": {
    "framework_key": null,
    "additional_frameworks": [],
    "extraction": {
      "analysis_type": "relationship-aware prior work genealogical scanning",
      "analysis_type_plural": "prior work scans",
      "core_question": "What genealogical connections exist between this prior work and the current work, given the classified relationship type?",
      "extraction_steps": [
        "RECEIVE RICH CONTEXT: Review the FULL target work profile from Pass 1 (ideas with their vocabulary, methodological signatures, metaphors, framing, domain crossings, genealogical hints) AND the relationship classification from Pass 1B (including vocabulary_overlap, methodological_similarity, metaphor_overlap, specific_ideas_to_trace, and key_aspects_to_probe). These give you PRECISE search targets, not just generic ideas.",

        "ADAPT STRATEGY BASED ON RELATIONSHIP TYPE:",

        "--- IF DIRECT PRECURSOR: Trace ideas with full dimensional comparison ---",
        "PRIORITIZE specific_ideas_to_trace from Pass 1B — these have the strongest connection signals",
        "FOR EACH TRACED IDEA: Don't just confirm presence. Compare VOCABULARY (same terms? precursor terms? semantic drift?), METHODOLOGY (same argumentative moves?), METAPHORS (same or evolved?), and FRAMING (was this tentative before but definitive now? exploratory before but axiomatic now?). Populate vocabulary_comparison, methodological_comparison, metaphor_comparison, and framing_comparison for each trace.",
        "FRAMING COMPARISON IS CRITICAL: If an idea was 'tentative' in the prior work but 'definitive' in the current work, that's an escalation signal. If 'exploratory' became 'axiomatic', that's even stronger. Record the trajectory precisely — Pass 5 needs this for tactic detection.",
        "NOTE ABSENCES: Record ideas not present and assess significance — especially ideas the author presents as 'established' in the current work that DON'T appear here.",
        "Populate: traces_found (with all comparison fields), ideas_not_found, new_discoveries.",

        "--- IF INDIRECT CONTEXTUALIZER: Match methodological signatures ---",
        "USE the target work's overall_methodological_profile as your search template. For each of the author's recurring_analytical_moves and primary_evidence_types, look for the SAME MOVES in this prior work.",
        "MATCH argumentative_structure: Does the author build arguments the same way here? This is the smoking gun for foundational influence.",
        "For each foundational pattern found, fill in matched_methodological_signature to explicitly link it to the target work's profile.",
        "TRACK VOCABULARY that carries forward — even if used differently, terms that persist across works reveal deep intellectual commitments.",
        "Populate: foundational_patterns primarily (with matched_methodological_signature and vocabulary_carried_forward).",

        "--- IF DIFFERENT FIELD RELEVANT: Trace domain crossings to their source ---",
        "USE the target work's domain_crossings as your map. Each crossing identifies a source_domain and what_is_imported. If this prior work IS that source domain, trace exactly what was imported and how it was transformed.",
        "ASSESS whether the cross-domain move preserves or distorts the original concept's meaning and validity.",
        "IDENTIFY metaphors that originated in this domain and now do analytical work in the target work.",
        "Populate: cross_domain_transfers primarily, plus any foundational_patterns.",

        "--- IF COUNTER POSITION: Focus on reversals with framing evidence ---",
        "IDENTIFY specific positions reversed or significantly modified. USE the target work's framing data — positions now presented as 'self_evident' or 'definitive' are prime candidates for being reversals from earlier 'tentative' or 'contested' positions.",
        "For each reversal, document the VOCABULARY shift (did the same words change meaning?), FRAMING shift (tentative → definitive?), and EVIDENCE shift (same evidence, different conclusion?).",
        "ASSESS how the author MANAGES the reversal — this feeds directly into Pass 5's tactic detection.",
        "Populate: reversal_analysis primarily, plus traces_found for ideas that persist in modified form.",

        "--- IF TANGENTIAL: Minimal analysis ---",
        "Brief scan for unexpected vocabulary or methodological matches. If truly tangential, document why.",

        "ALWAYS: Flag new discoveries not in the target idea list. Pay special attention to ideas that appear in this prior work but the author chose NOT to carry forward — strategic omissions are genealogically significant."
      ],
      "key_fields": {
        "trace_id": "Unique identifier for each genealogical trace (direct precursors)",
        "pattern_id": "Unique identifier for each foundational pattern (indirect contextualizers)",
        "transfer_id": "Unique identifier for each cross-domain transfer (different-field works)",
        "reversal_id": "Unique identifier for each position reversal (counter-positions)",
        "target_idea_id": "Cross-reference to Pass 1 idea",
        "form_in_prior_work": "How the idea manifests in the prior work",
        "confidence": "How confident we are in this trace"
      },
      "id_field": "trace_id",
      "key_relationships": [
        "is_precursor_of",
        "contradicts",
        "partially_anticipates",
        "frames_differently",
        "provides_foundation_for",
        "transfers_framework_to",
        "reverses_position_from"
      ],
      "special_instructions": "CRITICAL: You now receive a RICH multi-dimensional profile of the target work — not just idea names but vocabulary maps, methodological signatures, metaphors, framing choices, domain crossings, and positioning moves. USE ALL OF THIS. Your analysis strategy MUST be determined by the relationship_type from Pass 1B, but your SEARCH TARGETS come from Pass 1's rich profile. For direct precursors: don't just confirm an idea exists — compare vocabulary, methods, metaphors, and framing between the two works. The framing_comparison field is ESSENTIAL for downstream tactic detection: if something was 'tentative' before and is 'definitive' now, that's exactly what Pass 5 needs. For indirect contextualizers: match the target work's methodological signatures against this work — same analytical moves in different domains is the key signal. For different-field works: trace domain_crossings back to their source. Always use specific_ideas_to_trace and key_aspects_to_probe from Pass 1B to focus your search — these have already been pre-filtered for relevance."
    },
    "curation": {
      "item_type": "trace",
      "item_type_plural": "traces",
      "consolidation_rules": [
        "Group traces by target idea",
        "Group foundational patterns by pattern type",
        "Rank by confidence level",
        "Flag contradictory forms as high priority for evolution analysis",
        "Flag foundational patterns with unconscious author_awareness as especially significant"
      ],
      "cross_doc_patterns": [
        "idea_emergence",
        "position_evolution",
        "pattern_persistence",
        "cross_domain_importation"
      ],
      "synthesis_outputs": [
        "trace_catalog",
        "foundational_patterns_catalog",
        "cross_domain_transfer_map"
      ],
      "special_instructions": null
    },
    "concretization": {
      "id_examples": [
        {
          "from": "TR1",
          "to": "Proto-form of 'functional economy' in earlier automation analysis"
        },
        {
          "from": "FP1",
          "to": "Strategic reasoning framework from game theory enabling market power analysis"
        },
        {
          "from": "XD1",
          "to": "Nash equilibrium thinking imported from game theory to platform economics"
        },
        {
          "from": "REV1",
          "to": "Reversal from 'capitalism can be saved' to 'capitalism is already dead'"
        }
      ],
      "naming_guidance": "Use trace form + target idea name for direct precursors; pattern name + how it enables for indirect contextualizers; transfer type for cross-domain; reversal description for counter-positions",
      "recommended_table_types": [
        "trace_catalog",
        "foundational_patterns_catalog",
        "cross_domain_transfer_map",
        "reversal_catalog"
      ],
      "recommended_visual_patterns": []
    },
    "audience_vocabulary": {
      "researcher": {},
      "analyst": {},
      "executive": {},
      "activist": {}
    },
    "skip_concretization": false
  },
  "apps": [
    "critic"
  ]
}
