{
  "engine_key": "genealogy_pass5_evolution_tactics",
  "engine_name": "Genealogy Pass 5: Evolution Tactics Detection",
  "description": "Fifth pass of intellectual genealogy: detects specific evolution tactics — the recurring patterns authors use when dealing with their own prior positions. Identifies conceptual recycling, silent revision, selective continuity, strategic amnesia, and other tactics. The taxonomy of tactics is defined in this engine's canonical schema.",
  "version": 2,
  "status": "deprecated",
  "deprecated_reason": "Replaced by genealogy_synthesis chain (Phase 6 migration). Passes 3-6 collapsed into single chain.",
  "category": "rhetoric",
  "kind": "extraction",
  "reasoning_domain": "genealogy_analysis",
  "researcher_question": "What tactics does this author use to manage the relationship between their prior and current work?",
  "canonical_schema": {
    "tactics_detected": [
      {
        "tactic_id": "string (format: 'TACT{N}')",
        "tactic_type": "conceptual_recycling | silent_revision | selective_continuity | retroactive_framing | escalation | narrative_bootstrapping | framework_migration | condition_shift | biographical_teleology | strategic_amnesia",
        "tactic_name": "string - human-readable name of this tactic instance",
        "description": "string - what this specific instance involves",
        "idea_ids_involved": ["string - which idea_ids from Pass 1 are affected"],
        "prior_work_references": [
          {
            "work_title": "string - title of the prior work",
            "relevant_quote": "string - quote from the prior work showing the earlier position"
          }
        ],
        "current_work_evidence": [
          {
            "quote": "string - quote from the current work showing the current position",
            "location": "string - approximate location"
          }
        ],
        "vocabulary_evidence": "string - how vocabulary changes support this tactic detection (e.g., 'same term used with opposite meaning', 'prior term abandoned in favor of new coinage', 'precursor term evolved into current coined term'). Reference specific terms from the target work's vocabulary map.",
        "framing_evidence": "string - how framing shifts support this tactic detection (e.g., 'was tentative in 2015 work, now presented as axiomatic without new justification'). Reference the framing_comparison data from Pass 2 traces.",
        "methodological_evidence": "string - how methodological continuity or change supports this tactic (e.g., 'same evidence cited but conclusion reversed', 'same argumentative structure applied to opposite conclusion'). Reference methodological_comparison from Pass 2.",
        "severity": "major | moderate | minor",
        "assessment": "string - analysis of what this tactic achieves, what it conceals, and what it reveals about the author's intellectual management"
      }
    ],
    "tactic_patterns": {
      "most_frequent_tactic": "string - the most commonly used tactic type",
      "tactic_distribution": {
        "conceptual_recycling": "number",
        "silent_revision": "number",
        "selective_continuity": "number",
        "retroactive_framing": "number",
        "escalation": "number",
        "narrative_bootstrapping": "number",
        "framework_migration": "number",
        "condition_shift": "number",
        "biographical_teleology": "number",
        "strategic_amnesia": "number"
      },
      "pattern_narrative": "string - what the overall tactic usage reveals about how this author manages their intellectual history"
    },
    "evolution_tactics_taxonomy": {
      "conceptual_recycling": "Reusing arguments from prior work in a new framework where they serve a different function. The old argument is preserved but recontextualized — like using the same building materials for a different building.",
      "silent_revision": "Quietly changing position from prior work without acknowledging the shift. The author previously held position X, now holds position Y, but writes as if they always held Y.",
      "selective_continuity": "Claiming continuity with prior work while substantively departing from it. The author says 'as I argued before...' but the current position is materially different from what they actually argued.",
      "retroactive_framing": "Presenting current position as always having been the view, retroactively rewriting intellectual history. The author's earlier exploratory or tentative claims are presented as prescient foresight.",
      "escalation": "Taking a qualified or tentative prior claim and presenting it as established fact. What was 'this might suggest...' becomes 'as we know...' without new evidence justifying the confidence increase.",
      "narrative_bootstrapping": "Using the authority of prior work to legitimize current claims without re-establishing the evidence. The credibility earned from previous careful work is spent on current speculative claims.",
      "framework_migration": "Moving concepts from one theoretical home to another without justifying the move. A concept developed within framework A is transplanted into framework B with no discussion of whether the transplant is valid. NOTE: Pass 2 now detects cross_domain_transfers from different-field works and foundational_patterns from indirect contextualizers — these are prime sources of framework migration. When an author imports analytical methods from game theory into political economy, that IS framework migration.",
      "condition_shift": "Changing the assessed conditions while keeping conclusions similar. The same evidence is used but the diagnosis of the world-situation has changed — like Varoufakis moving from 'capitalism can be saved' to 'capitalism is dead' while citing the same QE evidence.",
      "biographical_teleology": "Presenting reactive intellectual evolution as intentional, directed development. What was actually a series of responsive adjustments is narrated as a purposeful intellectual journey toward the current position.",
      "strategic_amnesia": "Forgetting inconvenient prior positions, predictions, or commitments. Earlier claims that turned out wrong or that conflict with current positions are simply not mentioned, as if they never existed."
    },
    "meta": {
      "total_tactics_detected": "number",
      "tactics_by_severity": {
        "major": "number",
        "moderate": "number",
        "minor": "number"
      },
      "ideas_most_affected": ["string - idea_ids with the most tactics applied to them"],
      "key_findings": ["string"]
    }
  },
  "extraction_focus": [
    "evolution_tactics",
    "intellectual_self_management",
    "position_shifts",
    "rhetorical_strategies"
  ],
  "primary_output_modes": [
    "structured_text_report",
    "table"
  ],
  "paradigm_keys": [],
  "source_file": "intellectual_genealogy_workflow",
  "stage_context": {
    "framework_key": null,
    "additional_frameworks": [],
    "extraction": {
      "analysis_type": "evolution tactics detection",
      "analysis_type_plural": "evolution tactics analyses",
      "core_question": "What recurring tactics does this author employ to manage the relationship between their prior and current positions?",
      "extraction_steps": [
        "RECEIVE RICH EVIDENCE: You now have THREE layers of evidence: (1) the target work's rich profile from Pass 1 (vocabulary, methodological signatures, metaphors, framing choices, positioning moves), (2) Pass 2's dimensional comparisons (vocabulary_comparison, methodological_comparison, metaphor_comparison, framing_comparison for each trace), and (3) Pass 3's evolution timelines. USE ALL THREE LAYERS.",

        "DETECT ESCALATION using framing_comparison data: For each trace where Pass 2 recorded a framing shift (e.g., prior_framing='tentative' → current_framing='definitive'), check whether new evidence justifies the confidence increase. If not, this is escalation. The framing_comparison field is your PRIMARY evidence for this tactic. Also check the target work's framing.presented_as field — ideas presented as 'self_evident' or 'axiomatic' without justification in the current text are escalation candidates.",

        "DETECT CONCEPTUAL RECYCLING using vocabulary data: For each idea, compare Pass 1's vocabulary (coined terms, repurposed terms) against Pass 2's vocabulary_comparison (shared_terms, prior_terms_replaced, semantic_drift). When the same argument appears under new vocabulary, or old terms are used for new purposes, that's conceptual recycling. The vocabulary_evidence field must cite specific terms.",

        "DETECT RETROACTIVE FRAMING using positioning_profile: Compare the target work's claimed_novelty and claimed_continuity (from Pass 1's positioning_profile) against the actual evidence from Pass 2. If the author CLAIMS continuity ('as I've always argued') but Pass 2 shows the prior position was materially different, that's retroactive framing. If the author CLAIMS novelty but Pass 2 shows full_form traces in prior works, that's also significant.",

        "DETECT FRAMEWORK MIGRATION using domain_crossings + Pass 2 cross_domain_transfers: When the target work's domain_crossings show imports from other fields, and Pass 2's cross_domain_transfers detail how those imports actually work, check whether the migration is acknowledged or silent. Unacknowledged framework migration is a tactic.",

        "DETECT SILENT REVISION using Pass 2 traces with contradictory_form: Any trace where form_in_prior_work='contradictory_form' is a candidate for silent revision if the author doesn't acknowledge the reversal.",

        "DETECT SELECTIVE CONTINUITY using vocabulary + framing: When the author uses continuity language ('building on my earlier work') but the vocabulary_comparison shows semantic_drift or the framing_comparison shows shifted confidence levels, the claimed continuity is selective.",

        "ASSESS EACH TACTIC: For every tactic detected, populate vocabulary_evidence, framing_evidence, and methodological_evidence with specific references to the upstream data. These evidence fields make the detection VERIFIABLE rather than impressionistic.",

        "RATE SEVERITY: Major = significantly misrepresents the intellectual record with clear evidence from vocabulary/framing/method comparisons. Minor = common scholarly practice. Moderate = in between.",

        "LOOK FOR CLUSTERS: Tactics often work together (narrative_bootstrapping + escalation, selective_continuity + retroactive_framing). Identify these patterns.",

        "CHECK INDIRECT SOURCES: Review foundational_patterns and cross_domain_transfers from Pass 2 for framework_migration and strategic_amnesia tactics.",

        "SYNTHESIZE PATTERN: Describe what the overall tactic usage reveals, grounded in the vocabulary, framing, and methodological evidence."
      ],
      "key_fields": {
        "tactic_id": "Unique identifier for each detected tactic instance",
        "tactic_type": "Which tactic from the taxonomy this instance represents",
        "severity": "How significantly this tactic distorts the intellectual record"
      },
      "id_field": "tactic_id",
      "key_relationships": [
        "conceals",
        "distorts",
        "legitimates",
        "enables"
      ],
      "special_instructions": "Be rigorous but fair. Not every change of mind is a 'tactic' — genuine intellectual development is normal and healthy. Focus on cases where the MANAGEMENT of the change is noteworthy. You now have UNPRECEDENTED evidence quality: Pass 1 gives you the target work's vocabulary, methodology, metaphors, framing, and positioning; Pass 2 gives you vocabulary_comparison, methodological_comparison, metaphor_comparison, and framing_comparison for each trace. USE THIS EVIDENCE. Every tactic you detect must be grounded in specific vocabulary_evidence, framing_evidence, or methodological_evidence — not just your impression. The framing_comparison data is especially powerful: when Pass 2 records prior_framing='tentative' → current_framing='definitive', that IS escalation evidence. When vocabulary_comparison shows semantic_drift, that IS potential conceptual_recycling evidence. When the positioning_profile claims novelty but Pass 2 shows full_form traces, that IS retroactive_framing evidence. Make your detections VERIFIABLE."
    },
    "curation": {
      "item_type": "tactic",
      "item_type_plural": "tactics",
      "consolidation_rules": [
        "Group by tactic type",
        "Rank by severity",
        "Identify tactic clusters that work together",
        "Cross-reference with ideas from Pass 1"
      ],
      "cross_doc_patterns": [
        "recurring_tactic_types",
        "tactic_clusters"
      ],
      "synthesis_outputs": [
        "tactic_catalog",
        "tactic_distribution"
      ],
      "special_instructions": null
    },
    "concretization": {
      "id_examples": [
        {
          "from": "TACT1",
          "to": "Escalation: 'automation might reduce employment' (2015) → 'automation has already eliminated meaningful work' (2025)"
        }
      ],
      "naming_guidance": "Use tactic type + brief description of what shifted",
      "recommended_table_types": [
        "tactic_catalog",
        "severity_distribution"
      ],
      "recommended_visual_patterns": []
    },
    "audience_vocabulary": {
      "researcher": {
        "tactic_type": "intellectual management strategy"
      },
      "analyst": {},
      "executive": {
        "tactic_type": "argument consistency issue"
      },
      "activist": {}
    },
    "skip_concretization": false
  },
  "apps": [
    "critic"
  ]
}
