{
  "key": "brandomian",
  "name": "Brandomian Inferentialism",
  "description": "Robert Brandom's inferentialist framework for analyzing meaning through inferential commitments, entitlements, and the game of giving and asking for reasons.",
  "paradigm_keys": ["brandomian"],
  "primer": "## THE BRANDOMIAN FRAMEWORK: A DEEP PRIMER\n\nYou are about to perform analysis using Robert Brandom's inferentialist framework.\nThis is NOT a superficial keyword exercise. You need to understand the DEPTH of\nthis approach to do it justice.\n\n### 1. THE CORE INSIGHT: MEANING IS INFERENTIAL ROLE\n\nForget the picture theory of meaning (words as labels for things). Brandom's\nradical claim: **to understand a concept is to master its inferential role**.\n\nWhat does this mean practically?\n- You understand \"dog\" not by pointing at dogs, but by knowing:\n  - What FOLLOWS from something being a dog (it's an animal, it can bark, etc.)\n  - What would ENTITLE you to call something a dog (four legs, fur, barks, etc.)\n  - What's INCOMPATIBLE with being a dog (being a cat, being inanimate, etc.)\n\nThis is why we analyze INFERENTIAL COMMITMENTS - they ARE the meaning.\n\n### 2. THE GAME OF GIVING AND ASKING FOR REASONS\n\nDiscourse isn't information transfer. It's a NORMATIVE PRACTICE.\n\nWhen someone asserts something, they're not just making sounds - they're:\n- **Undertaking a commitment** (putting themselves on the hook)\n- **Claiming entitlement** (implying they have the right to say this)\n- **Changing the score** (altering what others can demand of them)\n\nEvery conversation is a game where we:\n- Challenge each other: \"Why do you think that?\"\n- Hold each other accountable: \"But you also said X, which contradicts this\"\n- Grant and withdraw authority: \"Given your expertise, I'll take your word\"\n\n### 3. COMMITMENT VS. ENTITLEMENT: THE CRUCIAL DISTINCTION\n\nThese are DEONTIC STATUSES - normative standings, not psychological states.\n\n**COMMITMENT**: What you're HELD TO, not what you believe.\n- If you assert P, you're committed to P regardless of your private doubts\n- You inherit DOWNSTREAM commitments (if P implies Q, you're committed to Q)\n- Others can HOLD you to these commitments\n- You can be committed to things you don't realize you're committed to\n\n**ENTITLEMENT**: Your AUTHORITY to make a claim.\n- Having reasons that would justify the claim if challenged\n- Inheriting entitlement from other entitled claims\n- Testimony: borrowing entitlement from others' authority\n- Default entitlement: claims presumed okay unless challenged\n\nTHE ASYMMETRY IS CRUCIAL:\n- You can be COMMITTED without being ENTITLED (making a claim you shouldn't)\n- You can be ENTITLED without being COMMITTED (having the right but not exercising it)\n- Discourse polices this gap: \"You have no right to say that!\"\n\n### 4. MATERIAL INFERENCE: CONTENT, NOT JUST FORM\n\nFormal logic: \"All A are B; X is A; therefore X is B\" - valid by FORM.\n\nMaterial inference: \"It's raining → the streets will be wet\" - valid by CONTENT.\n\nBrandom (following Sellars): Material inferences are PRIMARY. They're what give\nconcepts their content. \"Rain\" and \"wet streets\" are connected not by logic\nbut by how the world works and how we use these concepts.\n\nWhen analyzing text, look for:\n- What CONTENT-BASED inferences are treated as valid?\n- What domain makes these inferences good?\n- What would DEFEAT them (counterexamples, unusual circumstances)?\n\n### 5. INCOMPATIBILITY: MORE FUNDAMENTAL THAN ENTAILMENT\n\nBrandom's radical claim: **incompatibility is more basic than implication**.\n\nYou understand \"red\" primarily by knowing it EXCLUDES \"green\" (at the same spot),\nnot by knowing what it implies. The space of reasons is carved up by what\nCAN'T be held together.\n\nTypes of incompatibility:\n- **Logical**: Formal contradiction (P and not-P)\n- **Material**: Can't both be true given how concepts work (\"The ball is red all over\" vs \"The ball is blue all over\")\n- **Practical**: Can't act on both (\"Go left\" vs \"Go right\")\n- **Normative**: Can't consistently endorse both positions\n\n### 6. SCOREKEEPING: THE SOCIAL-PERSPECTIVAL DIMENSION\n\nHere's where it gets interesting: **different people keep different scores**.\n\nWhen you assert something:\n- YOU update your own commitments and entitlements\n- OTHERS update what they ATTRIBUTE to you (which may differ!)\n- The game involves tracking these multiple perspectives\n\nThis means:\n- What you think you're committed to ≠ what others hold you to\n- Disputes often involve disagreement about the score itself\n- Authority is perspectivally distributed\n\n### 7. DEFAULT VS. EARNED ENTITLEMENT\n\nNot all claims carry equal burden. This is crucial for analysis:\n\n**DEFAULT ENTITLEMENT**: Claims you can make unless challenged.\n- Some things are just assumed okay until someone objects\n- \"Technology shapes experience\" - most would nod along\n- These reveal the SHARED ASSUMPTIONS of a discourse community\n- Question: Who could challenge this and be taken seriously?\n\n**EARNED ENTITLEMENT**: Claims requiring upfront justification.\n- Some things you have to PROVE before anyone will accept them\n- \"Postphenomenology supersedes Heidegger\" - controversial, needs backing\n- These reveal where the author is STICKING THEIR NECK OUT\n- Question: What would count as sufficient proof?\n\n**THE ANALYTICAL PAYOFF**: Claims with default entitlement show power structures.\nWhat \"goes without saying\" reveals what the discourse community takes for granted.\nClaims requiring earned entitlement show where real argumentative work happens.\n\n### 8. THE PERSPECTIVAL GAP: WHAT YOU THINK YOU'RE SAYING VS. WHAT OTHERS HEAR\n\nBrandom's scorekeeping is PERSPECTIVAL. Different parties track different scores.\n\n**WHAT THE AUTHOR UNDERTAKES** - commitments they'd acknowledge:\n- \"Yes, I'm claiming technologies mediate experience\"\n- These are the OFFICIAL positions\n\n**WHAT READERS MIGHT ATTRIBUTE** - commitments they'll be held to:\n- \"So you're saying there's no authentic human nature?\"\n- These are the IMPLICATIONS others will draw\n\nThe most interesting findings: Where authors would be SURPRISED by what their\nposition commits them to. The \"wait, I didn't mean THAT\" moments.\n\n**THE ANALYTICAL PAYOFF**: Map both what authors THINK they're committing to\nAND what careful readers would hold them to. The gap is revelatory.\n\n### 9. EXPRESSIVE VOCABULARY: WHERE THEY SHOW THEIR WORK\n\nBrandom's insight: Words like \"therefore,\" \"because,\" \"however,\" \"but\" don't\nadd content - they make VISIBLE the inferential moves that were already implicit.\n\n**SHOWING THEIR WORK**: \"X, therefore Y\"\n- The author EXPLICITLY displays the inference\n- They're inviting challenge to the connection itself\n- This is where they feel CONFIDENT\n\n**SNEAKING IT IN**: \"X. Y follows naturally...\"\n- The inference is BURIED, presented as obvious\n- Not opened for inspection\n- Often the WEAKEST links are hidden this way\n\n**USING \"BUT\" OR \"HOWEVER\"**: These flag incompatibilities the author acknowledges\n- Valuable map of their own sense of tensions\n- Shows where they see trade-offs\n\n**THE ANALYTICAL PAYOFF**: Hidden inferences are often vulnerable. Explicit ones\nare where the author feels confident. This reveals actual argumentative structure.\n\n### 10. THE CITATION BAGGAGE PROBLEM\n\nWhen you endorse or cite someone, you're not just taking one idea - you're\ninheriting a PACKAGE. But people try to cherry-pick.\n\nFor each major citation/endorsement:\n- **WHAT THEY WANT**: The specific claim or insight they're borrowing\n- **WHAT COMES WITH IT**: The other commitments that position carries\n- **WHAT THEY TRY TO LEAVE BEHIND**: The implications they dodge\n- **CAN YOU ACTUALLY DO THAT?**: Is the cherry-picking coherent?\n\n**THE ANALYTICAL PAYOFF**: Reveals whether intellectual debts are being\nhonestly acknowledged or selectively exploited.\n\n### 11. PERFORMATIVE CONTRADICTIONS: DOES THE WALK MATCH THE TALK?\n\nBeyond logical and material incompatibility, look for where the author's\nPRACTICE contradicts their CLAIMS:\n\n**SELF-REFUTING MOVES**:\n- Claiming \"universal claims about Technology are impossible\" IS a universal claim\n- Arguing \"all knowledge is situated\" from a position claiming to see the whole picture\n- Insisting \"we can only analyze case-by-case\" while drawing general conclusions\n\n**THE PRAGMATIC TEST**: Does how they argue fit with what they're arguing?\n- If they claim empirical grounding, is the argument actually empirical?\n- If they reject grand narratives, do they sneak in a grand narrative?\n\n**THE ANALYTICAL PAYOFF**: Performative contradictions are devastating findings.\nThey show the position undermines itself.\n\n### 12. THE AUTHORITY LANDSCAPE: WHO GETS TO JUST ASSERT?\n\nEntitlement isn't just about having good reasons - it's about SOCIAL STANDING.\nDifferent speakers get different levels of default credibility.\n\n**HIGH DEFAULT ENTITLEMENT** (can just assert):\n- The field's founders and canonical figures\n- Claims aligned with institutional consensus\n- Methodologically \"safe\" positions\n\n**LOW DEFAULT ENTITLEMENT** (must prove credentials):\n- Newcomers challenging orthodoxy\n- Interdisciplinary interlopers\n- Claims that threaten institutional interests\n\n**THE ASYMMETRY MATTERS**: The same claim from a senior figure vs. a graduate\nstudent faces different entitlement demands. This isn't fair, but it's real,\nand it shapes what gets taken seriously.\n\n**THE ANALYTICAL PAYOFF**: Reveals the power structures in intellectual discourse.\n\n### 13. ARE THEY EVEN TALKING ABOUT THE SAME THING?\n\nBefore mapping disagreement, check: do disputants share meanings?\n\n**VERBAL DISAGREEMENT**: Same word, different concepts\n- Author A: \"mediation\" means X, implies Y\n- Author B: \"mediation\" means X', implies Y'\n- They SEEM to disagree but actually have different topics\n\n**VERBAL AGREEMENT**: Different words, same concept\n- They seem to be different positions but actually agree\n\n**THE TEST**: What would each party accept as EVIDENCE for or against their\nclaims? If they'd accept different evidence, they may be talking about\ndifferent things despite using the same vocabulary.\n\n**THE ANALYTICAL PAYOFF**: Often reveals that debates are talking past each\nother, which is crucial for understanding why they can't be resolved.\n\n### 14. THE STRENGTH OF THE HOOK: MUST, MAY, OR USUALLY?\n\nNot all implications bind equally. Classify each:\n\n**IRON-CLAD (\"Must\")**: If you accept A, you HAVE TO accept B. No wiggle room.\n- Test: Would denying B while affirming A be outright contradictory?\n\n**STRONG DEFAULT (\"Usually\")**: Normally committed to B unless special reason.\n- Test: Could you coherently say \"Yes A, but not B because [specific reason]\"?\n\n**PERMISSIVE (\"May\")**: A opens up the POSSIBILITY of B without forcing it.\n- Test: Does A enable B without requiring it?\n\n**CONTESTED**: Whether A implies B is itself the dispute.\n- Test: Do competent users of these concepts disagree about the connection?\n\n**THE ANALYTICAL PAYOFF**: Focus energy on \"Usually\" - that's where there's\nactual argumentative play. \"Must\" is locked in; \"May\" is optional.\n\n### 15. THE OPEN HORIZON: WHAT MIGHT THIS TURN OUT TO MEAN?\n\nBrandom's deep insight: the content of concepts isn't fully determined in\nadvance. Future developments can reveal what we were \"really\" committed to.\n\n**WHAT MIGHT THIS TURN OUT TO MEAN?**\n- What future discoveries could change what this commits us to?\n- What's the not-yet-determined content that remains open?\n- Where might proponents be surprised by where this leads?\n\n**RETROACTIVE VINDICATION**:\n- Could this position turn out to be RIGHT in ways not currently appreciated?\n- Could it turn out to be WRONG in ways the author can't see?\n\n**THE ANALYTICAL PAYOFF**: Reveals the LIVE potential of ideas, not just\ntheir current state. Speculative but powerful.\n\n### WHY THIS MATTERS FOR ANALYSIS\n\nWhen you analyze a text through this lens, you're revealing:\n- The HIDDEN STRUCTURE of what's being taken for granted\n- The NORMATIVE FORCE that propagates through the discourse\n- What readers are being INVITED TO COMMIT TO (often without realizing)\n- Where the PRESSURE POINTS are (incompatibilities that create tension)\n- What DISCURSIVE MOVES are available and what they cost\n- The POWER STRUCTURES shaping who can say what\n- The PERSPECTIVAL GAPS between authorial intention and reader attribution\n- The PERFORMATIVE TENSIONS where practice contradicts position\n\nThis is powerful because it exposes the BINDING FORCE of language that\nreaders often experience without understanding.\n\n---\n\nNOW: Apply this framework with full sophistication internally, but your\nOUTPUT will be translated into accessible language for non-philosophers.\nThe analysis should be Brandomian; the presentation should be clear.",
  "vocabulary": {
    "researcher": {
      "commitment": "inferential commitment",
      "entitlement": "deontic entitlement",
      "incompatibility": "material incompatibility",
      "implication": "material inference",
      "backing": "testimonial/inferential entitlement",
      "hidden_implication": "collateral commitment",
      "choice": "incompatibility relation",
      "authority": "default/earned entitlement status"
    },
    "analyst": {
      "commitment": "commitment (what you're locked into)",
      "entitlement": "entitlement (your basis for claiming)",
      "incompatibility": "incompatibility (can't hold both)",
      "implication": "implication (what follows)",
      "backing": "backing (what supports this)",
      "hidden_implication": "hidden commitment",
      "choice": "either/or choice",
      "authority": "authority standing"
    },
    "executive": {
      "commitment": "what you're signing up for",
      "entitlement": "what gives you the right to say this",
      "incompatibility": "you can't have it both ways",
      "implication": "where this leads in practice",
      "backing": "what backs this up",
      "hidden_implication": "what else you end up stuck with",
      "choice": "pick one - can't have both",
      "authority": "who gets believed without proof"
    },
    "activist": {
      "commitment": "what they're locked into",
      "entitlement": "their justification",
      "incompatibility": "the contradiction",
      "implication": "the real-world consequence",
      "backing": "the weak point",
      "hidden_implication": "what they don't want you to notice",
      "choice": "force them to choose",
      "authority": "who's getting a free pass"
    }
  }
}
