{
  "analytical_dimensions": [
    {
      "depth_guidance": {
        "deep": "Full classification with primary and secondary types, detailed evidence for each, assessment of how the relationship may have shifted over time, and analysis of whether the author would agree with the classification",
        "standard": "Assign relationship type with a brief justification citing specific textual evidence from both works, noting any secondary relationship types that also apply",
        "surface": "Assign one of the five relationship types based on the most prominent signal"
      },
      "description": "The core classification: what kind of intellectual relationship exists between the prior work and the current work? This is a forced-choice among five types, each with distinct implications for how subsequent passes should investigate the connection.\n",
      "key": "relationship_type",
      "probing_questions": [
        "Does the current argument directly build on, extend, or refine ideas from this prior work? (direct_precursor)",
        "Does this prior work set a broader intellectual context without directly feeding specific arguments? (indirect_contextualizer)",
        "Does the current work borrow analytical tools, methods, or frameworks from this prior work? (methodological_ancestor)",
        "Does the current work explicitly or implicitly argue against positions taken in this prior work? (contradicted_position)",
        "Do similar ideas appear in both works without evidence of direct causal influence? (parallel_development)"
      ]
    },
    {
      "depth_guidance": {
        "deep": "Comprehensive evidence map: all citations, vocabulary transfers, structural echoes, rhetorical responses, conspicuous absences, and assessment of evidence reliability",
        "standard": "Gather 3-5 pieces of evidence including citations, vocabulary overlap, structural parallels, and conspicuous absences",
        "surface": "Cite 1-2 strongest pieces of evidence"
      },
      "description": "Textual and structural evidence supporting the classification. What specific passages, citations, arguments, or structural echoes justify assigning this relationship type? Evidence quality determines classification confidence.\n",
      "key": "relationship_evidence",
      "probing_questions": [
        "Are there direct citations or acknowledgments linking the works?",
        "Do shared vocabulary or technical terms appear across both works?",
        "Are there structural parallels in argument organization or methodology?",
        "Does the current work respond to, critique, or extend specific claims from the prior work?",
        "Are there conspicuous absences -- ideas that SHOULD be cited but are not?"
      ]
    },
    {
      "depth_guidance": {
        "deep": "Nuanced strength assessment including how strength varies across different aspects of the work, whether strength is increasing or decreasing over time, and comparison to other prior works' influence",
        "standard": "Assign strength with assessment of centrality, pervasiveness, and evidence directness",
        "surface": "Assign strong/moderate/weak with one-sentence justification"
      },
      "description": "How strong is the connection? A direct precursor with strong influence is fundamentally different from a direct precursor with weak influence. Strength is assessed on a three-point scale: strong, moderate, weak.\n",
      "key": "relationship_strength",
      "probing_questions": [
        "How central is this prior work to the current argument -- could the argument exist without it?",
        "How pervasive is the influence -- does it affect the whole work or just one section?",
        "How direct is the evidence -- explicit citation vs. implicit borrowing vs. structural echo?"
      ]
    },
    {
      "depth_guidance": {
        "deep": "Full channel analysis: all active channels, their interactions, how channels reinforce or undermine each other, and which channels the author is aware of vs. which operate below conscious awareness",
        "standard": "Map all active channels with specific evidence for each and relative importance ranking",
        "surface": "Identify the 1-2 most active influence channels"
      },
      "description": "Through which specific channels does the prior work influence the current work? Vocabulary (shared terms and concepts), methodology (analytical tools and approaches), audience (preparation of readers), authority (credibility lending), and framing (how problems are defined and structured). Multiple channels may be active simultaneously.\n",
      "key": "influence_channels",
      "probing_questions": [
        "Does the current work adopt vocabulary or technical terms from the prior work?",
        "Does the current work use methodological approaches pioneered or refined in the prior work?",
        "Did the prior work prepare an audience that the current work now addresses?",
        "Does the author's authority on this topic derive partly from the prior work?",
        "Does the prior work frame the problem space in ways the current work inherits?"
      ]
    },
    {
      "depth_guidance": {
        "deep": "Full strategic assessment: priority dimensions ranked, expected trace types with specific hypotheses, attention allocation with justification, risk assessment of misclassification, and recommendations for how to revise classification if Pass 2 evidence contradicts it",
        "standard": "Scanning strategy with priority dimensions, expected trace types, and recommended attention level (high/medium/low)",
        "surface": "One-sentence scanning recommendation"
      },
      "description": "How does this classification affect downstream genealogical analysis? What should Pass 2 scanning prioritize given this relationship type? This dimension bridges classification and strategy -- it translates the taxonomic judgment into operational guidance.\n",
      "key": "strategic_relevance",
      "probing_questions": [
        "Given this relationship type, what dimensions should Pass 2 scan for most carefully?",
        "What kinds of traces should the scanner expect to find?",
        "How much attention should this prior work receive relative to others?",
        "What would a missed classification (wrong type) cost in analytical quality?"
      ]
    }
  ],
  "apps": [
    "critic",
    "visualizer"
  ],
  "capabilities": [
    {
      "depth_scaling": {
        "deep": "Primary and secondary types with full evidence, assessment of whether relationship has shifted over time, analysis of discrepancy between author's framing and actual connection, evaluation of whether author would agree with classification.",
        "standard": "Primary type with brief justification from textual evidence, plus identification of any secondary relationship types that also apply.",
        "surface": "Primary relationship type assigned based on strongest single textual signal (e.g., explicit citation framing or methodological parallel)."
      },
      "description": "Assign one of five relationship types (direct_precursor, indirect_contextualizer, methodological_ancestor, contradicted_position, parallel_development) based on textual evidence",
      "extended_description": "This capability performs the fundamental act of intellectual triage that determines all downstream genealogical investigation. Drawing on Harold Bloom's insight that influence is not uniform but takes specific forms—the anxiety-laden struggle with precursors, the strategic misreading, the deliberate evasion—it asks: what is the precise mode of connection between this prior work and the current argument? The classification is not merely descriptive but strategic, recognizing that a direct_precursor (whose ideas flow directly into the current work) demands close textual comparison for vocabulary transfers and argumentative inheritances, while a methodological_ancestor (whose tools rather than conclusions were adopted) requires scanning for structural parallels and analytical frameworks. A contradicted_position (against which the current work defines itself) leaves traces in rhetorical moves and oppositional framing, while a parallel_development (where similar ideas emerged independently) requires evidence of NON-connection—the absence of citations, the different vocabularies, the divergent intellectual contexts.\n\nThis capability enables all subsequent genealogical work by determining how deeply and in what manner each prior work should be investigated. Without accurate classification, the genealogical pipeline wastes investigative resources: scanning a methodological_ancestor for vocabulary transfers yields nothing, while treating a direct_precursor as mere context misses the core of the relationship. The classification also determines which dimensions of relationship_evidence matter most and which influence_channels are likely to be active. It is the hinge between discovery (identifying that a relationship exists) and analysis (understanding what kind of relationship it is).\n\nWhat makes this non-trivial is that relationships are often hybrid or contested. An author may treat a work as indirect context while actually borrowing its methodology wholesale; a contradicted position may simultaneously function as a direct precursor for the very terms of debate. The capability must assign a primary type while remaining alert to secondary types, and must distinguish between the author's conscious relationship to a prior work and the actual intellectual connection. A naive classification reads only explicit citations; a sophisticated one reads structural echoes, conspicuous absences, and the difference between acknowledged and unacknowledged debts.",
      "indicators": [
        "Explicit citations that frame the prior work in specific ways (\"building on,\" \"extending,\" \"challenging,\" \"in the context of\")",
        "Vocabulary clusters that appear in both works but with different theoretical freight or framing",
        "Methodological parallels (similar analytical moves, similar data structures, similar argument architectures) without explicit acknowledgment",
        "Oppositional rhetoric that defines the current position against an earlier one (\"unlike X,\" \"while previous approaches,\" \"against the conventional view\")",
        "Parallel independent development signals: similar publication dates, different intellectual circles, no citation trail, different terminologies for similar ideas"
      ],
      "intellectual_grounding": {
        "concept": "anxiety_of_influence",
        "method": "Bloom argues that influence is not passive reception but active struggle, taking specific forms (clinamen, tessera, kenosis, etc.). This capability applies that insight by insisting that relationships must be typed—that the mode of influence determines its traces and effects.",
        "thinker": "bloom"
      },
      "key": "classify_relationship",
      "produces_dimensions": [
        "relationship_type",
        "relationship_evidence"
      ],
      "requires_dimensions": []
    },
    {
      "depth_scaling": {
        "deep": "Nuanced strength profile showing how strength varies across different aspects of the work (methodology vs. substance), whether strength is stable or shifting over time, and comparative strength relative to other prior works in the genealogy.",
        "standard": "Strength rating with separate assessment of centrality (could argument exist without it), pervasiveness (whole work or sections), and evidence directness (explicit vs. implicit).",
        "surface": "Strong/moderate/weak assignment based on citation frequency and centrality language in one or two key passages."
      },
      "description": "Evaluate the strength of the intellectual relationship on a three-point scale",
      "extended_description": "This capability evaluates the intensity and pervasiveness of the intellectual relationship, recognizing that not all direct_precursors are equally direct, not all methodological_ancestors equally ancestral. Drawing on bibliometric traditions that distinguish between ceremonial citations and constitutive ones, it asks three questions: How central is this prior work to the current argument's possibility (could the argument exist without it)? How pervasive is the influence (does it affect one section or the entire work)? How direct is the evidence (explicit citation, implicit borrowing, or structural echo)? A strong relationship means the current work could not exist in its present form without the prior work; a moderate relationship means significant but not constitutive influence; a weak relationship means peripheral or highly localized influence.\n\nThis capability directly feeds strategic_relevance by determining attention allocation. A strong direct_precursor demands intensive Pass 2 scanning across multiple dimensions; a weak indirect_contextualizer may require only surface scanning for general framing. Without strength assessment, the pipeline treats all relationships as equal, wasting deep analysis on peripheral works while under-investigating formative ones. The capability also interacts with relationship_type: strength means different things for different types. A strong contradicted_position might appear throughout the work's rhetorical structure; a strong methodological_ancestor might be cited only once but structure every analytical move.\n\nThe non-trivial challenge is distinguishing genuine strength from ceremonial prominence. A work cited frequently might be weak (mere authority-lending); a work cited once might be strong (the single citation marking adoption of an entire framework). Strength also varies by aspect: a prior work might strongly influence methodology but weakly influence substantive claims. A sophisticated assessment tracks these variations rather than forcing a single strength rating.",
      "indicators": [
        "Counterfactual test signals: language suggesting the current work builds essentially on the prior (\"following,\" \"as X showed,\" \"X's framework allows us to\")",
        "Pervasiveness signals: the prior work appears in multiple sections, frames multiple arguments, or structures the overall analytical approach",
        "Evidence directness: explicit block quotes and detailed engagement vs. passing citation vs. no citation but clear structural borrowing",
        "Negative evidence: conspicuous absence of a work that should be cited given the topic, suggesting anxiety or deliberate avoidance",
        "Comparative prominence: how this prior work is treated relative to others in the same category"
      ],
      "intellectual_grounding": {
        "concept": "footnote_as_evidence",
        "method": "Grafton demonstrates that citation patterns reveal intellectual relationships when read critically—not all footnotes signify equal debt. This capability applies that insight by assessing centrality, pervasiveness, and evidence directness rather than simply counting citations.",
        "thinker": "grafton"
      },
      "key": "assess_strength",
      "produces_dimensions": [
        "relationship_strength"
      ],
      "requires_dimensions": [
        "relationship_type"
      ]
    },
    {
      "depth_scaling": {
        "deep": "Full channel analysis showing interactions between channels (vocabulary transfers carrying methodological assumptions), channels reinforcing or undermining each other, and distinction between channels the author consciously recognizes versus those operating below awareness.",
        "standard": "Complete channel map with specific evidence for each active channel and relative importance ranking (primary, secondary, tertiary).",
        "surface": "Identification of the 1-2 most obviously active channels based on explicit citations and clear vocabulary transfers."
      },
      "description": "Identify the specific channels through which influence flows: vocabulary, methodology, audience, authority, framing",
      "extended_description": "This capability identifies the specific vectors through which intellectual influence travels, recognizing that prior works shape current arguments through distinct channels: vocabulary (terms and concepts adopted or adapted), methodology (analytical tools and frameworks), audience (preparation of readers to receive certain arguments), authority (credibility that transfers to the current author), and framing (how problems are defined and bounded). Drawing on Cambridge School contextualism—particularly Skinner's attention to how concepts carry their histories and Pocock's focus on vocabularies as carriers of tradition—it asks not just whether influence exists but through what specific conduits it flows. A methodological_ancestor typically influences through methodology and possibly framing channels; a direct_precursor often through vocabulary and framing; a contradicted_position through framing (defining the problem space) and potentially authority (positioning against an established view).\n\nThis capability is crucial for strategic_relevance because it determines what Pass 2 scanners should look for. If the influence channel is primarily vocabulary, subsequent scanning should focus on concept_evolution and vocabulary_transfer dimensions. If methodology, then structural_inheritance and analytical_framework dimensions become priority. If audience, then reception_history and presupposition_structure dimensions matter most. The capability also reveals channel interactions: vocabulary transfers often carry methodological assumptions; audience preparation often involves authority transfer. Multiple channels can be active simultaneously, and their relative importance varies by relationship type.\n\nThe non-trivial dimension is that channels often operate below conscious awareness. An author may acknowledge vocabulary borrowing while remaining unaware of methodological inheritance; conversely, an author may credit methodological influence while the actual channel is problem framing. Channels can also be negative—a contradicted position's vocabulary might be deliberately avoided even as its problem framing is inherited. A sophisticated mapping distinguishes between channels the author recognizes and those operating implicitly.",
      "indicators": [
        "Vocabulary signals: technical terms from the prior work appearing in the current work, especially if defined similarly or adapted with explicit acknowledgment",
        "Methodology signals: parallel analytical moves, similar data structures, similar forms of evidence or argumentation, adoption of specific analytical frameworks",
        "Audience signals: statements assuming readers know the prior work, references to debates the prior work initiated, positioning within a conversation the prior work established",
        "Authority signals: citations that lend credibility (\"as the definitive study shows\"), appeals to the prior work's empirical or theoretical authority",
        "Framing signals: adoption of how the prior work defines the problem, bounds the domain, identifies what counts as evidence, or structures the analytical space"
      ],
      "intellectual_grounding": {
        "concept": "intentionalism",
        "method": "Skinner argues that understanding a text requires reconstructing what the author was doing with inherited concepts and vocabularies. This capability applies that insight by mapping the specific channels (vocabulary, methodology, framing) through which those inheritances travel.",
        "thinker": "skinner"
      },
      "key": "map_influence_channels",
      "produces_dimensions": [
        "influence_channels"
      ],
      "requires_dimensions": [
        "relationship_type",
        "relationship_evidence"
      ]
    },
    {
      "depth_scaling": {
        "deep": "Complete strategic guidance including ranked priority dimensions with specific hypotheses for each, expected trace types with concrete examples, attention allocation with justification, misclassification risk assessment, and contingency instructions for revising classification if Pass 2 evidence contradicts it.",
        "standard": "Scanning strategy specifying priority dimensions (ranked list), expected trace types (structural, rhetorical, conceptual), and attention level (high/medium/low with justification).",
        "surface": "One-sentence scanning recommendation (e.g., \"High attention, prioritize structural inheritance and vocabulary transfer dimensions\")."
      },
      "description": "Translate classification into operational guidance for downstream genealogical passes",
      "extended_description": "This capability translates the taxonomic judgments of classification, strength assessment, and channel mapping into operational guidance for downstream genealogical passes. It asks: given that this prior work has been classified as (type) with (strength) through (channels), what should Pass 2 dimensional scanners prioritize? What kinds of traces should they expect to find? How much investigative attention should this prior work receive relative to others? Drawing on the bibliometric tradition's resource allocation logic and the broader intellectual history tradition's understanding that not all archival work yields equal insight, it performs strategic triage. A strong direct_precursor with active vocabulary and framing channels demands high-attention scanning across concept_evolution, vocabulary_transfer, argument_structure_inheritance, and presupposition_structure dimensions. A weak indirect_contextualizer with only audience-preparation channels requires only surface scanning of reception_history and contemporaneous_discourse dimensions.\n\nThis capability bridges Pass 1.5 and Pass 2, transforming classification into action. It prevents the genealogical pipeline from treating all prior works uniformly, enabling efficient allocation of what is always the scarcest resource: deep analytical attention. It also produces contingency guidance: what would a missed classification cost? If this work was misclassified, what signals would emerge in Pass 2 to prompt reclassification? The capability must balance precision (scanning exactly where traces are likely) against flexibility (remaining open to unexpected findings). It also accounts for interaction effects: some prior works should be scanned together because their channels reinforce each other; others should be scanned separately because they represent competing influences.\n\nThe non-trivial challenge is that strategic guidance must be specific enough to direct attention but flexible enough to accommodate surprise. A naive strategy says \"scan everything for strong precursors, skip everything for weak contextualizers.\" A sophisticated strategy says \"for this strong methodological_ancestor, prioritize structural_inheritance and analytical_framework dimensions, expect methodological traces in argument architecture rather than explicit citation, allocate high attention but concentrate it in structural analysis; if Pass 2 finds strong vocabulary transfers instead, reclassify as potential direct_precursor and expand scanning to concept_evolution.\"",
      "indicators": [
        "Classification-strategy fit signals: certain relationship types predictably generate specific trace patterns (methodological_ancestors leave structural traces, contradicted_positions leave rhetorical traces)",
        "Strength-attention correlation signals: language in the current work indicating centrality or pervasiveness that demands high-attention investigation",
        "Channel-dimension alignment signals: active influence channels map onto specific Pass 2 dimensions (vocabulary channel → concept_evolution dimension)",
        "Trace expectation signals: evidence suggesting where scanning should look (methodology channel active → expect traces in analytical architecture, not just citations)",
        "Misclassification risk signals: ambiguous or hybrid relationships where getting the type wrong would send Pass 2 in the wrong direction"
      ],
      "intellectual_grounding": {
        "concept": "intellectual_triage",
        "method": "Lovejoy's method of tracing unit-ideas requires determining which historical connections merit deep investigation versus passing acknowledgment. This capability applies that triage logic by translating relationship classifications into prioritized scanning strategies.",
        "thinker": "lovejoy"
      },
      "key": "determine_scanning_strategy",
      "produces_dimensions": [
        "strategic_relevance"
      ],
      "requires_dimensions": [
        "relationship_type",
        "relationship_strength",
        "influence_channels"
      ]
    }
  ],
  "category": "scholarly",
  "composability": {
    "consumes_from": {
      "initial_similarity_signals": "From genealogy_prior_work_discovery (Pass 1) -- initial indications of relatedness",
      "prior_work_summaries": "From genealogy_deep_target_profiling -- structured profiles of each prior work",
      "target_work_profile": "From genealogy_deep_target_profiling -- profile of the current work being analyzed"
    },
    "shares_with": {
      "classification_evidence": "Textual evidence supporting each classification, reusable by synthesis passes",
      "influence_channel_map": "Which channels are active per prior work, guiding dimensional scanners in Pass 2",
      "relationship_classifications": "Typed relationship between each prior work and the target, used by all downstream passes to calibrate depth",
      "scanning_priorities": "Attention allocation recommendations for Pass 2 scanners"
    },
    "synergy_engines": [
      "conditions_of_possibility_analyzer",
      "concept_evolution",
      "evolution_tactics_detector"
    ]
  },
  "depth_levels": [
    {
      "description": "Rapid classification: assign relationship type and strength based on strongest signal",
      "key": "surface",
      "passes": [
        {
          "consumes_from": [],
          "description": "Rapid classification based on the strongest signal. Assign one\nof the five relationship types (direct_precursor, indirect_\ncontextualizer, methodological_ancestor, contradicted_position,\nparallel_development) and assess strength (strong/moderate/weak)\nwith one-sentence justification for each.\n",
          "focus_capabilities": [
            "classify_relationship",
            "assess_strength"
          ],
          "focus_dimensions": [
            "relationship_type",
            "relationship_strength"
          ],
          "label": "Rapid Relationship Classification",
          "pass_number": 1,
          "stance": "discovery"
        }
      ],
      "suitable_for": "Quick triage of large prior-work sets, preliminary pipeline planning, non-academic texts",
      "typical_passes": 1
    },
    {
      "description": "Full classification with evidence, all five channels assessed, scanning strategy produced",
      "key": "standard",
      "passes": [
        {
          "consumes_from": [],
          "description": "Full classification with textual evidence from both works.\nRelationship type assigned with justification and secondary\ntypes noted. Strength assessed across centrality, pervasiveness,\nand evidence directness. All five influence channels (vocabulary,\nmethodology, audience, authority, framing) evaluated with\nspecific evidence. Scanning strategy produced with priority\ndimensions and recommended attention level for Pass 2.\n",
          "focus_capabilities": [
            "classify_relationship",
            "assess_strength",
            "map_influence_channels",
            "determine_scanning_strategy"
          ],
          "focus_dimensions": [
            "relationship_type",
            "relationship_strength",
            "influence_channels",
            "strategic_relevance"
          ],
          "label": "Full Classification & Scanning Strategy",
          "pass_number": 1,
          "stance": "inference"
        }
      ],
      "suitable_for": "Standard genealogy pipeline Pass 1.5, most academic texts, authors with 3-10 prior works",
      "typical_passes": 1
    },
    {
      "description": "Nuanced classification with primary and secondary types, temporal evolution of relationship, full channel interaction analysis, detailed strategic guidance with contingency plans",
      "key": "deep",
      "passes": [
        {
          "consumes_from": [],
          "description": "Nuanced classification with primary and secondary types, each\nsupported by detailed evidence. Assessment of how the\nrelationship may have shifted over time (temporal evolution).\nFull channel interaction analysis showing how influence channels\nreinforce or undermine each other. Detailed strategic guidance\nwith contingency plans: priority dimensions ranked, expected\ntrace types with specific hypotheses, and recommendations for\nrevising classification if Pass 2 evidence contradicts it.\n",
          "focus_capabilities": [
            "classify_relationship",
            "assess_strength",
            "map_influence_channels",
            "determine_scanning_strategy"
          ],
          "focus_dimensions": [
            "relationship_type",
            "relationship_strength",
            "influence_channels",
            "strategic_relevance"
          ],
          "label": "Nuanced Classification & Strategic Guidance",
          "pass_number": 1,
          "stance": "inference"
        }
      ],
      "suitable_for": "Complex intellectual relationships, works that defy easy classification, cases where misclassification risk is high",
      "typical_passes": 1
    }
  ],
  "engine_key": "genealogy_relationship_classification",
  "engine_name": "Genealogy Relationship Classification",
  "intellectual_lineage": {
    "key_concepts": [
      "anxiety_of_influence",
      "intentionalism",
      "footnote_as_evidence",
      "influence_channels",
      "intellectual_triage",
      "convergent_evolution",
      "strategic_classification"
    ],
    "primary": "bloom",
    "secondary": [
      "skinner",
      "grafton",
      "lovejoy"
    ],
    "traditions": [
      "anxiety_of_influence",
      "cambridge_school",
      "reception_history",
      "bibliometrics",
      "intellectual_history"
    ]
  },
  "kind": "extraction",
  "legacy_engine_key": "genealogy_pass1b_relationship_classification",
  "paradigm_keys": [
    "genealogical"
  ],
  "problematique": "Not all prior works are equal. When we trace the intellectual genealogy\nof an argument, we must first classify the NATURE of each relationship\nbefore we can determine how deeply to investigate it. A methodological\nancestor -- one whose analytical tools were adopted wholesale -- demands\na fundamentally different investigation than an indirect contextualizer\nthat merely set the broader intellectual climate.\n\nThis engine performs that triage. For each prior work, it asks: what is\nthe precise intellectual relationship to the current argument? Is this\na direct precursor whose ideas flow straight into the current work? A\ncontradicted position that the author argues against? A parallel\ndevelopment where similar ideas emerged independently? The classification\nis not merely taxonomic -- it is STRATEGIC. It determines the depth and\ndirection of all subsequent genealogical scanning.\n\nThe five relationship types form a spectrum of influence directness:\ndirect_precursor (the current argument could not exist without this work),\nindirect_contextualizer (sets the stage but does not directly feed the\nargument), methodological_ancestor (provides the HOW rather than the WHAT),\ncontradicted_position (the current work defines itself AGAINST this), and\nparallel_development (convergent evolution of ideas without causal link).\n\nThe classification also assesses CHANNELS of influence -- does the prior\nwork contribute vocabulary, methodology, audience preparation, authority,\nor framing? These channels determine where to look for traces in Pass 2.\nA methodological ancestor leaves traces in analytical structure; a\ncontradicted position leaves traces in argumentative rhetoric; an\nindirect contextualizer leaves traces in presupposed background knowledge.\n\nSpeed matters here. This engine operates on truncated excerpts and must\nclassify rapidly. It is a triage instrument, not a deep analysis tool.\nIts value lies in enabling the genealogical pipeline to allocate\ninvestigative resources efficiently -- spending deep attention where it\nwill yield the richest findings.\n",
  "researcher_question": "What is the precise intellectual relationship between this prior work and the current argument?",
  "version": 1
}